tap "homebrew/dupes"
tap "homebrew/core"
tap "homebrew/versions"
tap "homebrew/bundle"
tap "d12frosted/emacs-plus"
tap "caskroom/cask"
tap "neovim/neovim"

brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bat"
brew "binutils"
brew "cairo"
brew "carthage"
brew "clang-format"
brew "cmake"
brew "emacs"
brew "emacs-plus"
brew "fd"
brew "ffmpeg"
brew "gdbm"
brew "gettext"
brew "gifsicle"
brew "git"
brew "go"
brew "graphviz"
brew "grep"
brew "groovy"
brew "htop"
brew "libffi"
brew "libtool"
brew "libyaml"
brew "memcached"
brew "mysql"
brew "openssl"
brew "openssh"
brew "pkg-config"
brew "sqlite"
brew "python3"
brew "rbenv"
brew "screen"
brew "swiftgen"
brew "swiftlint"
brew "vim"
brew "youtube-dl"
brew "d12frosted/emacs-plus/emacs-plus", link: false

cask "1password"
cask "amethyst"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "java"
cask "slack"
cask "spotify"